Repository: nguyenhunga5/opi5-kodi-addons
Catalog: visualization.shadertoy/resources/language/resource.language.*/strings.po
Languages: da_dk, de_de, fi_fi, fr_fr, ru_ru, zh_cn

# Addon Summary
source: Visualizations from Shadertoy
da_dk: Visualiseringer fra Shadertoy
de_de: Visualisierungen von Shadertoy
fi_fi: Shadertoy-visualisointeja
fr_fr: Visualisations de Shadertoy
ru_ru: Визуализации от Shadertoy
zh_cn: 来自ShaderToy的可视化效果

# Addon Description
source: This music visualization is based on Shadertoy based GPU programs.
da_dk: Denne musikvisualisering er baseret på Shadertoy-baserede GPU-programmer.
de_de: Diese Musikvisualisierung basiert auf Shadertoy-basierten GPU-Programmen.
fi_fi: Tämä äänen visualisointi perustuu Shadertoy-pohjaisiin grafiikkasuoritinohjelmiin.
fr_fr: Cette visualisation musicale est basée sur des programmes GPU basés sur Shadertoy.
ru_ru: Это музыкальная визуализация основана на графических программах, в состав которых входит Shadertoy.
zh_cn: 次音乐可视化是基于基于Shadertoy的GPU程序。

# #30000
source: General
da_dk: Generel
de_de: Allgemein
fi_fi: Yleiset
fr_fr: Général
ru_ru: Общие
zh_cn: 常规

# #30001
source: iChannel 0
fi_fi: iKanava 0

# #30002
source: iChannel 1
fi_fi: iKanava 1
fr_fr: iCanal 1

# #30003
source: iChannel 2
fi_fi: iKanava 2
fr_fr: iCanal 2

# #30004
source: iChannel 3
fi_fi: iKanava 3
fr_fr: iCanal 3

# #30010
source: Choose one yourself
da_dk: Vælg selv én
de_de: Bitte einen auswählen
fi_fi: Valitse yksi itse
fr_fr: Choisissez-en un vous-même
ru_ru: Выберите один из имеющихся
zh_cn: 自己选一个

# #30011
source: Use your own shadertoy. Attention: Some shaders are not supported by some GPU's in performance!
da_dk: Brug dit egen shadertoy. OBS: Nogle shaders understøttes ikke i ydeevne af nogle GPU'er!
de_de: Eigenes Shadertoy verwenden. Achtung: Einige Shader werden von einigen GPUs in ihrer Leistung nicht unterstützt!
fi_fi: Käytä omaa shadertoy-ohjelmaasi. Huomioi: Kaikki grafiikkasuorittimet eivät ole riittävän tehokkaita kaikille varjostimille!
fr_fr: Utilisez votre propre shadertoy. Attention : Certains shaders ne sont pas supportés par certains GPU en performance !
ru_ru: Использовать ваш собственный shadertoy. Внимание: некоторые шейдеры могут быть плохо совместимы с некоторыми моделями графических карт!
zh_cn: 使用自己的shadertoy。注意：一些GPU在性能中不支持一些着色器！

# #30012
source: Shadertoy file
da_dk: Shadertoy-fil
de_de: Shadertoy-Datei
fi_fi: Shadertoy-tiedosto
fr_fr: Fichier Shadertoy
ru_ru: Файл Shadertoy
zh_cn: Shadertoy文件

# #30013
source: Shader as *.glsl
da_dk: Shader som *.glsl
de_de: Shader als *.glsl
fi_fi: Varjostimen *.glsl-tiedosto
fr_fr: Shader comme *.glsl
ru_ru: Шейдер как *.glsl
zh_cn: 着色器为 *.glsl

# #30014
source: Channel 0 as audio
da_dk: Kanal 0 som lyd
de_de: Kanal 0 als Audio
fi_fi: Kanava 0 ääneksi
fr_fr: Canal 0 comme audio
ru_ru: Канал 0 как аудио
zh_cn: 通道0为音频

# #30015
source: Use audio stream data on channel 0
da_dk: Brug data til lydstream på kanal 0
de_de: Audio-Stream-Daten für Kanal 0 verwenden
fi_fi: Äänivirtatieto kanavalla 0
fr_fr: Utiliser les données de flux audio sur le canal 0
ru_ru: Отправлять данные трансляции аудио на 0 канал
zh_cn: 在通道0上使用音频流数据

# #30016
source: Channel 0 texture image
da_dk: Kanal 0 overfladebillede
de_de: Texturbild für Kanal 0
fi_fi: Kanavan 0 tekstuurikuva
fr_fr: Texture de l'image du canal 0
ru_ru: Текстура 0 канала
zh_cn: 通道0纹理图像

# #30017
source: Channel 0 as *.png
da_dk: Kanal 0 som *.png
de_de: Kanal 0 als *.png
fi_fi: Kanavan 0 *.png-kuva
fr_fr: Canal 0 en *.png
ru_ru: Канал 0 как *.png
zh_cn: 通道0为* .png

# #30018
source: Channel 1 as audio
da_dk: Kanal 1 som lyd
de_de: Kanal 1 als Audio
fi_fi: Kanava 1 äänenä
fr_fr: Canal 1 comme audio
ru_ru: Канал 1 как аудио
zh_cn: 通道1作为音频

# #30019
source: Use audio stream data on channel 1
da_dk: Brug data til lydstream på kanal 1
de_de: Audio-Stream-Daten für Kanal 1 verwenden
fi_fi: Äänivirtatieto kanavalla 1
fr_fr: Utiliser les données de flux audio sur le canal 1
ru_ru: Отправлять данные трансляции аудио на 1 канал
zh_cn: 在通道1上使用音频流数据

# #30020
source: Channel 1 texture image
da_dk: Kanal 1 overfladebillede
de_de: Texturbild für Kanal 1
fi_fi: Kanavan 1 tekstuurikuva
fr_fr: Texture de l'mage du canal 1
ru_ru: Текстура 1 канала
zh_cn: 通道1纹理图像

# #30021
source: Channel 1 as *.png
da_dk: Kanal 1 som *.png
de_de: Kanal 1 als *.png
fi_fi: Kanavan 1 *.png-kuva
fr_fr: Canal 1 en *.png
ru_ru: Канал 1 как *.png
zh_cn: 通道1为* .png

# #30022
source: Channel 2 as audio
da_dk: Kanal 2 som lyd
de_de: Kanal 2 als Audio
fi_fi: Kanava 2 äänenä
fr_fr: Canal 2 comme audio
ru_ru: Канал 2 как аудио
zh_cn: 通道2作为音频

# #30023
source: Use audio stream data on channel 2
da_dk: Brug data til audiostream på kanal 2
de_de: Audio-Stream-Daten für Kanal 2 verwenden
fi_fi: Äänivirtatieto kanavalla 2
fr_fr: Utiliser les données de flux audio sur le canal 2
ru_ru: Отправлять данные трансляции аудио на 2 канал
zh_cn: 在通道2上使用音频流数据

# #30024
source: Channel 2 texture image
da_dk: Kanal 2 overfladebillede
de_de: Texturbild für Kanal 2
fi_fi: Kanavan 2 tekstuurikuva
fr_fr: Texture de l'image du canal 2
ru_ru: Текстура 2 канала
zh_cn: 通道2纹理图像

# #30025
source: Channel 2 as *.png
da_dk: Kanal 2 som *.png
de_de: Kanal 2 als *.png
fi_fi: Kanavan 2 *.png-kuva
fr_fr: Canal 2 en *.png
ru_ru: Канал 2 как *.png
zh_cn: 通道2为* .png

# #30026
source: Channel 3 as audio
da_dk: Kanal 3 som lyd
de_de: Kanal 3 als Audio
fi_fi: Kanava 3 äänenä
fr_fr: Canal 3 comme audio
ru_ru: Канал 3 как аудио
zh_cn: 通道3作为音频

# #30027
source: Use audio stream data on channel 3
da_dk: Brug data til lydstream på kanal 3
de_de: Audio-Stream-Daten für Kanal 3 verwenden
fi_fi: Äänivirtatieto kanavalla 3
fr_fr: Utiliser les données de flux audio sur le canal 3
ru_ru: Отправлять данные трансляции аудио на 3 канал
zh_cn: 在通道3上使用音频流数据

# #30028
source: Channel 3 texture image
da_dk: Kanal 3 overfladebillede
de_de: Texturbild für Kanal 3
fi_fi: Kanavan 3 tekstuurikuva
fr_fr: Texture de l'image du canal 3
ru_ru: Текстура 3 канала
zh_cn: 通道3纹理图像

# #30029
source: Channel 3 as *.png
da_dk: Kanal 3 som *.png
de_de: Kanal 3 als *.png
fi_fi: Kanavan 3 *.png-kuva
fr_fr: Canal 3 en *.png
ru_ru: Канал 3 как *.png
zh_cn: 通道3为* .png

# #30030
source: Shadertoy Visualization
da_dk: Shadertoy Visualisering
de_de: Shadertoy-Visualisierung
fi_fi: Shadertoy-visualisointi
fr_fr: Visualisation Shadertoy
ru_ru: Shadertoy визуализация
zh_cn: Shadertoy可视化

# #30031
source: Cannot read the JSON file. Please check the formatting is correct and the file is available.
da_dk: Kan ikke læse JSON-filen. Kontroller at formateringen er korrekt, og at filen er tilgængelig.
de_de: JSON-Datei kann nicht gelesen werden. Bitte prüfen, ob die Formatierung korrekt und dass die Datei verfügabr ist.
fi_fi: JSON-tiedoston luku ei onnistu. Tarkista, että se on muotoiltu oikein ja että tiedosto on käytettävissä.
fr_fr: Impossible de lire le fichier JSON. Veuillez vérifier que le formatage est correct et que le fichier est disponible.
ru_ru: Невозможно прочитать JSON файл. Пожалуйста, проверьте форматирование и доступность файла.
zh_cn: 无法读取JSON文件。请检查格式是否正确，文件是否可用。

# #30032
source: Path to custom preset list
da_dk: Sti til brugerdefineret liste med forudindstillinger
de_de: Pfad zur benutzerdefinierten Voreinstellungsliste
fi_fi: Oman esiastuslistan sijainti
fr_fr: Chemin d'accès à la liste des préréglages personnalisés
ru_ru: Путь к собственному списку предустановок
zh_cn: 定制预设列表的路径

# #30033
source: Set the path to your custom JSON-formatted preset file. If no path is configured, the add-on will use the default preset file.
da_dk: Indstil stien til din brugerdefinerede JSON-formaterede fil med forudindstillinger. Hvis der ikke er konfigureret nogen sti, bruger add-on'et standardfilen med forudindstillinger.
de_de: Pfad für eine benutzerdefinierte JSON-formatierte Voreinstellungsdatei. Wenn kein Pfad konfiguriert ist, wird das Addon die Standard-Voreinstellungsdatei verwenden.
fi_fi: Määritä oman JSON-muotoisen esiasetustiedoston sijainti. Jos sijaintia ei määritetä, lisäosa käyttää oletusarvoista esiasetustiedostoa.
fr_fr: Définir le chemin d'accès à votre fichier de préréglage personnalisé au format JSON. Si aucun chemin n'est configuré, le module complémentaire utilisera le fichier de préréglage par défaut.
ru_ru: Выберите путь к вашему файлу с предустановками в формате JSON. Если путь не выбран, дополнение будет использовать файл с предустановками по умолчанию.
zh_cn: 设置自定义JSON格式预设文件的路径。如果未配置路径，加载项将使用默认预设文件。

# #30034
source: Configure a single shader
da_dk: Konfigurer en enkelt shader
de_de: Einen einzelnen Shader konfigurieren
fi_fi: Määritä yksittäinen varjostin
fr_fr: Configurer un seul shader
ru_ru: Настроить одиночный шейдер
zh_cn: 配置单个着色器

# #30035
source: Show help about preset file
da_dk: Vis hjælp til den forudindstillede fil
de_de: Hilfe zu Voreinstellungsdatei anzeigen
fi_fi: Avaa esiasetustiedosto-opas
fr_fr: Afficher l'aide sur le fichier prédéfini
ru_ru: Показать справку о файле с предустановками
zh_cn: 显示有关预设文件的帮助

# #30036
source: Open to read about creating the JSON-formatted preset file.
da_dk: Åben for at læse om oprettelse af den JSON-formaterede forudindstillede fil.
de_de: Öffnen, um mehr über die Erstellung der JSON-formatierten Voreinstellungsdatei zu erfahren.
fi_fi: Tutustu JSON-muotoisten esiastustiedostojen luontiin.
fr_fr: Ouvrir pour en savoir plus sur la création du fichier de préréglage au format JSON.
ru_ru: Откройте, чтобы прочитать сведения о создании файла с предустановками в формате JSON.
zh_cn: 打开阅读关于创建JSON格式预设文件的帮助。

# #30037
source: Help about defining your own shaders in the JSON file
da_dk: Hjælp til at definere dine egne shaders i JSON-filen
de_de: Hilfe zur Definition eines benutzerdefinierten Shaders in der JSON-Datei
fi_fi: Ohjeita omien varjostimien määritykseen JSON-tiedostossa
fr_fr: Aide sur la définition de vos propres shaders dans le fichier JSON
ru_ru: Справка об использовании своих собственных шейдеров в JSON файле
zh_cn: 关于在JSON文件中定义自己的着色器的帮助
