Repository: nguyenhunga5/opi5-kodi-addons
Catalog: visualization.shadertoy/resources/language/resource.language.*/strings.po
Languages: da_dk, de_de, fi_fi, fr_fr, ru_ru, zh_cn

# #30038
source: [B][I]JSON file for user defined shader lists[/I][/B] The file [B]presets.json[/B] is used to define custom shaders. A custom path to the shader files (GLSL) can be declared in the add-on settings. Contents of [B]presets.json[/B] should be: [I] 1.[/I] Name of preset. Either hardcoded string or defined in [I]resources/language/.../strings.po[/I] [I] 2.[/I] GLSL shader to use. If no custom path was declared, the default [B]resources/[/B] will be used. Set custom path to './' to use shaders from the same path as your [B]presets.json[/B] file. [I] 3.[/I] Channel value 0. Defines the texture to use (e.g. PNG file). Can also be set to "audio" to pass related stream data within texture. The PNG and GLSL files should be located in the same directory. [I] 4.[/I] Channel value 1 definition. [I] 5.[/I] Channel value 2 definition. [I] 6.[/I] Channel value 3 definition. [I] 7.[/I] [I][Optional][/I] append string [B]"gl_only"[/B] to make this preset only available to OpenGL. [B]Example:[/B] [COLOR white][COLOR green]{[/COLOR] [COLOR blue]"presets"[/COLOR]:[ [COLOR gray]/* Default way used by the addon itself */[/COLOR] [ [COLOR red]"The Disco Tunnel by poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Description defined in strings.po */[/COLOR] [ 30100, [COLOR red]"audioeclipse.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Define custom file paths */[/COLOR] [ [COLOR red]"My own one"[/COLOR], [COLOR red]"/path/to/glsl/my.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]"/path/to/pngs/my_image.png"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Preset only available to OpenGL (see 7) */[/COLOR] [ [COLOR red]"Polar Beats by sauj123"[/COLOR], [COLOR red]"polarbeats.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]"gl_only"[/COLOR] ], [COLOR gray]/* GLSL and PNG files are in the same folder as presets.json */[/COLOR] [ [COLOR red]"Another one"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./my_01.png"[/COLOR], [COLOR red]"./my_02.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Select texture image by file name, use default "resources/" dir */[/COLOR] [ [COLOR red]"Fractal Land by Kali"[/COLOR], [COLOR red]"fractalland.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ] ][COLOR green]}[/COLOR][/COLOR]
da_dk: [B][I]JSON-fil til brugerdefinerede shaderlister[/I][/B] Filen [B]presets.json[/B] bruges til at præcisere brugerdefinerede shadere. En brugerdefineret sti til shaderfilerne (GLSL) kan indtastes i indstillinger for dette add-on. Indholdet i [B]presets.json[/B] skal være: [I] 1.[/I] Navn på forudindstilling. Enten direkte indtastet navn eller defineret i [I]resources/language/.../strings.po[/I] [I] 2.[/I] GLSL shader der bruges. Hvis ingen brugerdefineret sti er indtastet, bruges standarden [B]resources/[/B]. Indstil brugerdefineret sti til './' for at bruge shaders fra samme stil som din [B]presets.json[/B]-fil. [I] 3.[/I] Kanalværdi value 0. Definerer den brugte tekstur (f.eks.. PNG-fil). Det kan også indstilles til "audio" for at sende relateret streamdata til teksturen. PNG- og GLSL-filerne skal placeres i samme mappe. [I] 4.[/I] Defination af kanalværdi 1. [I] 5.[/I] Defination af kanalværdi 2. [I] 6.[/I] Defination af kanalværdi 3. [I] 7.[/I] [I][Valgfri][/I] tilføj teksten [B]"gl_only"[/B] for kun at gøre denne forudindstilling tilgængelig for OpenGL. [B]Eksempel:[/B] [COLOR white][COLOR green]{[/COLOR] [COLOR blue]"forudindstillinger"[/COLOR]:[ [COLOR gray]/* Standard metode brugt af selve add-on'et */[/COLOR] [ [COLOR red]"The Disco Tunnel af poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Beskrivelse defineret i strings.po */[/COLOR] [ 30100, [COLOR red]"audioeclipse.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Præciser brugerdefinerede filstier */[/COLOR] [ [COLOR red]"Min egen"[/COLOR], [COLOR red]"/sti/til/glsl/min.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]"/sti/til/png-filer/mit_billede.png"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* >Forudindstilling kun tilgængelig for OpenGL (se 7) */[/COLOR] [ [COLOR red]"Polar Beats af sauj123"[/COLOR], [COLOR red]"polarbeats.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]"gl_only"[/COLOR] ], [COLOR gray]/* GLSL- og PNG-filer er i samme mappe som presets.json */[/COLOR] [ [COLOR red]"En mere"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./min_01.png"[/COLOR], [COLOR red]"./min_02.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Vælg teksturbillede efter filnavn, brug standard "resources/"-mappe */[/COLOR] [ [COLOR red]"Fractal Land af Kali"[/COLOR], [COLOR red]"fractalland.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ] ][COLOR green]}[/COLOR][/COLOR]
de_de: [B][I]JSON-Datei für benutzerdefinierte Shader-Listen[/I][/B] Benutzerdefinierte Shader werden in der Datei [B]presets.json[/B] definiert. In den Addon-Einstellungen kann ein benutzdefinierter Pfad für Shader-Dateien (GLSL) hinterlegt werden. Inhalt von [B]presets.json[/B] sollte sein: [I] 1.[/I] Name der Voreinstellung. Entweder fixe Zeichenkette oder definiert in [I]resources/language/.../strings.po[/I] [I] 2.[/I] Zu verwendender GLSL-Shader. Wenn kein benutzerdefinierter Pfad festgelegt ist, wird standardmässig [B]resources/[/B] verwendet. Benutzerdefinierten Pfad auf ‚./‘ setzen, um Shader aus dem Pfad zu nutzen, in dem die Datei [B]presets.json[/B] sich befindet. [I] 3.[/I] Kanalwert 0. Legt die zu nutzende Textur fest (e.g. PNG file). Kann auch auf „audio“ gesetzt werden, um in der Textur enthaltene Stream-Daten weiterzugeben. Die PNG- und GLSL-Dateien sollten sich im gleichen Verzeichnis befinden. [I] 4.[/I] Definition für Kanalwert 1. [I] 5.[/I] Definition für Kanalwert 2. [I] 6.[/I] Definition für Kanalwert 3. [I] 7.[/I] [I][Optional][/I] die Zeichenkette [B]„gl_only“[/B] anhängen, um diese Voreinstellung nur für OpenGL zu nutzen. [B]Beispiel:[/B] [COLOR white][COLOR green]{[/COLOR] [COLOR blue]"presets"[/COLOR]:[ [COLOR gray]/* Default way used by the addon itself */[/COLOR] [ [COLOR red]"The Disco Tunnel by poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Description defined in strings.po */[/COLOR] [ 30100, [COLOR red]"audioeclipse.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Define custom file paths */[/COLOR] [ [COLOR red]"My own one"[/COLOR], [COLOR red]"/path/to/glsl/my.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]"/path/to/pngs/my_image.png"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Preset only available to OpenGL (see 7) */[/COLOR] [ [COLOR red]"Polar Beats by sauj123"[/COLOR], [COLOR red]"polarbeats.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]"gl_only"[/COLOR] ], [COLOR gray]/* GLSL and PNG files are in the same folder as presets.json */[/COLOR] [ [COLOR red]"Another one"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./my_01.png"[/COLOR], [COLOR red]"./my_02.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Select texture image by file name, use default "resources/" dir */[/COLOR] [ [COLOR red]"Fractal Land by Kali"[/COLOR], [COLOR red]"fractalland.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ] ][COLOR green]}[/COLOR][/COLOR]
fi_fi: [B][I]JSON-tiedosto käyttäjän määrittämille varjostinlistoille[/I][/B] Tiedostoa [B]presets.json[/B] käytetään omien varjostimien määritykseen. GLSL-varjostintiedostojen oma sijainti voidaan määrittää lisäosan asetuksista. Tiedoston [B]presets.json[/B] sisällön tulee olla: [I] 1.[/I] Esiasetuksen nimi. Joko pysyväksi koodattu merkkijono tai määritetty tiedostossa [I]resources/language/.../strings.po[/I] [I] 2.[/I] Käytettävä GLSL-varjostin. Jos omaa sijaintia ei määritetä, käytetään oletusarvoa [B]resources/[/B]. Määritä oman sijainnin arvoksi './' käyttääksesi varjostimia [B]presets.json[/B]-tiedoston sijainnista. [I] 3.[/I] Kanava-arvo 0. Määrittää käytettävän tekstuurin (esim. PNG-tiedosto). Voidaan määrittää myös ns. äänikanavaksi välittämään tietoa äänivirrasta tekstuurissa. PNG- ja GLSL-tiedostojen on sijaittava samassa kansiossa. [I] 4.[/I] Kanava-arvo 1. [I] 5.[/I] Kanava-arvo 2. [I] 6.[/I] Kanava-arvo 3. [I] 7.[/I] [I][Valinnainen][/I] Lisää merkintä [B]"gl_only"[/B], jotta esiasetus on vain OpenGL:n käytettävissä. [B]Esimerkki:[/B] [COLOR white][COLOR green]{[/COLOR] [COLOR blue]"presets"[/COLOR]:[ [COLOR gray]/* Lisäosan käyttämä oletustapa */[/COLOR] [ [COLOR red]"The Disco Tunnel kehittäjältä poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* strings.po-tiedostossa määritetty kuvaus */[/COLOR] [ 30100, [COLOR red]"audioeclipse.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Määritä omat tiedostosijainnit */[/COLOR] [ [COLOR red]"Minun omani"[/COLOR], [COLOR red]"/path/to/glsl/my.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]"/path/to/pngs/my_image.png"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Vain OpenGL:n käytettävissä olevat esiastukset (katso kohta 7) */[/COLOR] [ [COLOR red]"Polar Beats kehittäjältä sauj123"[/COLOR], [COLOR red]"polarbeats.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]"gl_only"[/COLOR] ], [COLOR gray]/* GLSL- ja PNG-tiedostot ovat samassa kansiossa presets.json-tiedoston kanssa */[/COLOR] [ [COLOR red]"Yksi lisää"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./my_01.png"[/COLOR], [COLOR red]"./my_02.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Valitse tekstuurikuva tiedostonimellä, käytä oletuskansiota "resources/" */[/COLOR] [ [COLOR red]"Fractal Land kehittäjältä Kali"[/COLOR], [COLOR red]"fractalland.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ] ][COLOR green]}[/COLOR][/COLOR]
fr_fr: [B][I]Fichier JSON pour les listes de shaders définies par l'utilisateur[/I][/B] Le fichier [B]presets.json[/B] est utilisé pour définir des shaders personnalisés. Un chemin personnalisé vers les fichiers de shader (GLSL) peut être déclaré dans les paramètres du module complémentaire. Le contenu de [B]presets.json[/B] doit être: [I] 1.[/I] Nom du préréglage. Chaîne codée en dur ou définie dans [I]resources/language/.../strings.po[/I] [I] 2.[/I] Shader GLSL à utiliser. Si aucun chemin personnalisé n'a été déclaré, les [B]ressources/[/B] par défaut seront utilisés. Définissez le chemin personnalisé sur './' pour utiliser les shaders du même chemin que votre fichier [B]presets.json[/B]. [I] 3.[/I] Valeur du canal 0. Définit la texture à utiliser (par exemple, fichier PNG). Peut également être défini sur "audio" pour transmettre les données de flux associées dans la texture. Les fichiers PNG et GLSL doivent se trouver dans le même répertoire. [I] 4.[/I] Définition de la valeur du canal 1. [I] 5.[/I] Définition de la valeur du canal 2. [I] 6.[/I] Définition de la valeur du canal 3. [I] 7.[/I] [I][Facultatif][/I] ajoutez la chaîne [B]"gl_only"[/B] pour rendre ce préréglage disponible uniquement pour OpenGL. [B]Exemple:[/B] [COULEUR blanc][COULEUR vert]{[/COLOR] [COULEUR bleu]"presets"[/COLOR] :[ [COLOR gray]/* Manière par défaut utilisée par l'addon lui-même */[/COLOR] [ [COLOR red]"The Disco Tunnel by poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red ]"tex15.png"[/COLOR], [COULEUR rouge]"audio"[/COLOR], [COULEUR rouge]""[/COLOR] ], [COULEUR gris]/* Description définie dans strings.po */[/COLOR] [ 30100, [COULEUR rouge]"audioeclipse.frag.glsl"[/COLOR], [COULEUR rouge]"audio"[/COLOR], [COULEUR rouge]""[/COLOR], [COULEUR rouge]""[/ COULEUR], [COULEUR rouge]""[/COULEUR] ], [COULEUR gris]/* Définir les chemins de fichiers personnalisés */[/COLOR] [ [COLOR red]"Mon propre"[/COLOR], [COLOR red]"/path/to/glsl/my.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COULEUR rouge]"/chemin/vers/pngs/mon_image.png"[/COLOR], [COULEUR rouge]""[/COLOR], [COULEUR rouge]""[/COLOR] ], [COLOR gray]/* Préréglage uniquement disponible pour OpenGL (voir 7) */[/COLOR] [ [COULEUR rouge]"Polar Beats by sauj123"[/COLOR], [COULEUR rouge]"polarbeats.frag.glsl"[/COLOR], [COULEUR rouge]"audio"[/COLOR], [COULEUR rouge]"" [/COLOR], [COULEUR rouge]""[/COLOR], [COULEUR rouge]""[/COLOR], [COULEUR rouge]"gl_only"[/COLOR] ], [COLOR gray]/* Les fichiers GLSL et PNG sont dans le même dossier que presets.json */[/COLOR] [ [COLOR red]"Un autre"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./my_01.png"[/COLOR], [COLOR rouge]"./my_02.png"[/COLOR], [COULEUR rouge]"audio"[/COLOR], [COULEUR rouge]""[/COLOR] ], [COULEUR gris]/* Sélectionnez l'image de texture par nom de fichier, utilisez le répertoire "ressources/" par défaut */[/COLOR] [ [COULEUR rouge]"Fractal Land par Kali"[/COLOR], [COULEUR rouge]"fractalland.frag.glsl"[/COLOR], [COULEUR rouge]"tex02.png"[/COLOR], [COULEUR rouge] "tex15.png"[/COLOR], [COULEUR rouge]"audio"[/COLOR], [COULEUR rouge]""[/COLOR] ] ][COULEUR vert]}[/COLOR][/COLOR]
ru_ru: [B][I]Пользовательский файл JSON, определяющий списки шейдеров[/I][/B] Файл [B]presets.json[/B] используется для определения собственных шейдеров. Собственный путь к файлам шейдеров (GLSL) может быть объявлен в настройках дополнения. Содержание [B]presets.json[/B] должно выглядить следующим образом: [I] 1.[/I] Названия файла с предустановками. Строка должна быть либо включёна в файл в виде кода, либо определёна в [I]resources/language/.../strings.po[/I] [I] 2.[/I] GLSL шейдер, который будет использоваться. Если собственный путь не будет определён, то по умолчанию будет использоваться [B]resources/[/B]. Пропишите в коде собственный путь как './' , чтобы использовать шейдеры, расположенные по тому же пути, что и ваш [B]presets.json[/B] файл. [I] 3.[/I] Значение канала 0. Определяет текстуру, которая будет использоваться (например, файл в формате PNG). Можно также прописать "audio", чтобы пропускать аудио данные в потоке внутри текстур. PNG и GLSL файлы должны быть расположены в одной директории. [I] 4.[/I] Определение значения 1 канала. [I] 5.[/I] Определение значения 2 канала. [I] 6.[/I] Определение значения 3 канала. [I] 7.[/I] [I][Optional][/I] добавьте в конце строку [B]"gl_only"[/B], чтобы сделать текущие предустановки доступными только для OpenGL. [B]Пример:[/B] [COLOR white][COLOR green]{[/COLOR] [COLOR blue]"Предустановки"[/COLOR]:[ [COLOR gray]/* Стандартный способ, который используется дополнением */[/COLOR] [ [COLOR red]"The Disco Tunnel by poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Описание, определённое в strings.po */[/COLOR] [ 30100, [COLOR red]"audioeclipse.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Определить собственный пути файла */[/COLOR] [ [COLOR red]"My own one"[/COLOR], [COLOR red]"/path/to/glsl/my.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]"/path/to/pngs/my_image.png"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Предустановки доступны только для OpenGl (пункт 7) */[/COLOR] [ [COLOR red]"Polar Beats by sauj123"[/COLOR], [COLOR red]"polarbeats.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]"gl_only"[/COLOR] ], [COLOR gray]/* GLSL и PNG находятся в той же папке, что и presets.json */[/COLOR] [ [COLOR red]"Another one"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./my_01.png"[/COLOR], [COLOR red]"./my_02.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Выбрать текстуру по имени файла; будет исользована директория по умолчанию: "resources/" dir */[/COLOR] [ [COLOR red]"Fractal Land by Kali"[/COLOR], [COLOR red]"fractalland.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ] ][COLOR green]}[/COLOR][/COLOR]
zh_cn: [B][I]用于用户定义着色器列表的 JSON 文件[/I][/B] 文件 [B]presets.json[/B] 用于定义自定义着色器。 可以在插件设置中声明着色器文件（GLSL）的自定义路径。 [B]presets.json[/B] 的内容应该是： [I] 1.[/I] 预设的名称。硬编码字符串或定义在 [I]resources/language/.../strings.po[/I] [I] 2.[/I] 要使用的 GLSL 着色器。如果未声明自定义路径，则将使用默认的 [B]resources/[/B] 目录。将自定义路径设置为 './' 使用与 [B]presets.json[/B] 文件同路径的着色器。 [I] 3.[/I] 通道值0。定义要使用的纹理（例如PNG文件）。也可以设置为“audio”以在纹理内传递相关流数据。PNG和GLSL文件应位于同一目录中。 [I] 4.[/I] 通道值1定义。 [I] 5.[/I] 通道值2定义。 [I] 6.[/I] 通道值3定义。 [I] 7.[/I] [I][可选][/I] 添加字符串 [B]"gl_only"[/B] 以使此预设仅对 OpenGL 可用。 [B]例子：[/B] [COLOR white][COLOR green]{[/COLOR] [COLOR blue]"presets"[/COLOR]:[ [COLOR gray]/* 插件本身使用的默认方式 */[/COLOR] [ [COLOR red]"The Disco Tunnel by poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* strings.po 中定义的描述 */[/COLOR] [ 30100, [COLOR red]"audioeclipse.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* 定义自定义文件路径 */[/COLOR] [ [COLOR red]"My own one"[/COLOR], [COLOR red]"/path/to/glsl/my.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]"/path/to/pngs/my_image.png"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* 预设仅适用于 OpenGL（请参见7） */[/COLOR] [ [COLOR red]"Polar Beats by sauj123"[/COLOR], [COLOR red]"polarbeats.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]"gl_only"[/COLOR] ], [COLOR gray]/* GLSL 和 PNG 文件与 presets.json 位于同一文件夹中 */[/COLOR] [ [COLOR red]"Another one"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./my_01.png"[/COLOR], [COLOR red]"./my_02.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* 按文件名选择纹理图像，使用默认的“resources/”目录 */[/COLOR] [ [COLOR red]"Fractal Land by Kali"[/COLOR], [COLOR red]"fractalland.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ] ][COLOR green]}[/COLOR][/COLOR]
