Repository: nguyenhunga5/opi5-kodi-addons
Catalog: screensaver.matrixtrails/resources/language/resource.language.*/strings.po
Languages: fi_fi

# Addon Summary
source: Matrix trails screensaver
fi_fi: Matrix-jäljet-näytönsäästäjä

# Addon Description
source: The "digital rain" effect, as seen on the computer monitors in "The Matrix".[CR][CR]In its settings you can also define your own colors and sizes of rain.
fi_fi: "The Matrix" -elokuvan tietokonenäytöiltä tuttu "digitaalinen sade" -tehoste.[CR][CR]Lisäosan asetuksista voit myös määrittää sateelle omat värit ja koot.

# #30000
source: Number of columns
fi_fi: Sarakkeiden määrä

# #30001
source: Number of rows
fi_fi: Rivien määrä

# #30002
source: Speed
fi_fi: Nopeus

# #30004
source: Number of columns to show on screen.
fi_fi: Ruudulla näkyvien sarakkeiden määrä.

# #30005
source: Number of rows to show on screen.
fi_fi: Ruudulla näkyvien rivien määrä.

# #30006
source: Accelerate how fast lines move down.
fi_fi: Kiihdytä rivien laskeutumisnopeutta.

# #30010
source: Colors
fi_fi: Värit

# #30011
source: Matrix raining
fi_fi: Matrix-sade

# #30012
source: Red
fi_fi: Punainen

# #30013
source: Strength of red color in the rain.
fi_fi: Punaisen värin voimakkuus sateessa.

# #30014
source: Green
fi_fi: Vihreä

# #30015
source: Strength of green color in the rain.
fi_fi: Vihreän värin voimakkuus sateessa.

# #30016
source: Blue
fi_fi: Sininen

# #30017
source: Strength of blue color in the rain.
fi_fi: Sinisen värin voimakkuus sateessa.

# #30018
source: Matrix rain event
fi_fi: Matrix-sadetehoste

# #30019
source: Red
fi_fi: Punainen

# #30020
source: Strength of red color on a event.
fi_fi: Punaisen värin voimakkuus, kun tapahtuu jotain.

# #30021
source: Green
fi_fi: Vihreä

# #30022
source: Strength of green color on a event.
fi_fi: Vihreän värin voimakkuus, kun tapahtuu jotain.

# #30023
source: Blue
fi_fi: Sininen

# #30024
source: Strength of blue color on a event.
fi_fi: Sinisen värin voimakkuus, kun tapahtuu jotain.
