Repository: nguyenhunga5/opi5-kodi-addons
Catalog: screensaver.shadertoy/resources/language/resource.language.*/strings.po
Languages: es_mx

# #30001
source: Ball
es_mx: Pelota

# #30002
source: Ball Of Fire
es_mx: Pelota de fuego

# #30003
source: Bleepy Blocks
es_mx: Bloques Pitantes

# #30004
source: Bob Scanline
es_mx: Escaneo de línea Bob

# #30005
source: Blobs
es_mx: Manchas

# #30006
source: Blue Fire
es_mx: Fuego azul

# #30007
source: Cellular
es_mx: Celular

# #30008
source: Classic RGB Plasma
es_mx: Plasma RGB clásico

# #30009
source: Coloured Circles
es_mx: Círculos coloreados

# #30010
source: Dance Floor
es_mx: Pista de baile

# #30011
source: Dot Dot Dot
es_mx: Punto Punto Punto

# #30012
source: Effect Ringblobs
es_mx: Efecto manchas de anillo

# #30013
source: Ether
es_mx: Éter

# #30014
source: Fire
es_mx: Fuego

# #30015
source: Flaring 1
es_mx: Destello 1

# #30016
source: Flaring 2
es_mx: Destello 2

# #30017
source: Flaring 3
es_mx: Destello 3

# #30018
source: Flaring 4
es_mx: Destello 4

# #30019
source: Flaring 5
es_mx: Destello 5

# #30020
source: Fractal Tiling
es_mx: Mosaicos fractales

# #30021
source: Infinite Fall
es_mx: Caída infinita

# #30022
source: Input Time
es_mx: Tiempo de entrada

# #30023
source: Interstellar
es_mx: Interestelar

# #30024
source: Interweaving Sine Bands
es_mx: Bandas sinusoidales entrelazadas

# #30025
source: Julia Trap
es_mx: Trampa de Julia

# #30026
source: Layers Of Plasma
es_mx: Capas de plasma

# #30027
source: Liquid Spectrum
es_mx: Espectro liquido

# #30028
source: Noise Animation - Electric
es_mx: Animación de ruido - Eléctrico

# #30029
source: Noise Animation - Flow
es_mx: Animación de ruido - Corriente

# #30030
source: Noise Animation - Lava
es_mx: Animación de ruido - Lava

# #30031
source: Noise Animation - Watery
es_mx: Animación de ruido - Acuoso

# #30032
source: Overly Satisfying
es_mx: Bastante satisfactorio

# #30033
source: Plasma Circles
es_mx: Círculos de plasma

# #30034
source: Plasma Triangles
es_mx: Triángulos de plasma

# #30035
source: Plasma Matrix Spin
es_mx: Giro de matriz de plasma

# #30036
source: Pixellated Plasma
es_mx: Plasma pixelado

# #30037
source: Silexars Creation
es_mx: Creación de Silexars

# #30038
source: Sky at Night
es_mx: Cielo nocturno

# #30039
source: Sphere
es_mx: Esfera

# #30040
source: Star Tunnel
es_mx: Túnel de estrellas

# #30041
source: Vector Field
es_mx: Campo de vectores

# #30043
source: Watch It Burn
es_mx: Míralo arder

# #30044
source: Water Caustic
es_mx: Agua Cáustica

# #30045
source: Wiggly (try mouse)
es_mx: Movido (try mouse)

# #30046
source: Worley Noise Waters
es_mx: Las aguas caudalosas de Worley

# #30100
source: Random
es_mx: Aleatorio

# #30102
source: Advanced
es_mx: Avanzado

# #30103
source: Use your own shader, e.g. from https://www.shadertoy.com
es_mx: Utiliza tu propio shader, ej. de https://www.shadertoy.com

# #30104
source: Selected shader code not found!
es_mx: ¡Código de shader seleccionado no encontrado!

# #30200
source: Choose one yourself
es_mx: Elige uno propio

# #30202
source: iChannel 1
es_mx: iCanal 1

# #30203
source: iChannel 2
es_mx: iCanal 2

# #30204
source: iChannel 3
es_mx: iCanal 3

# #30205
source: iChannel 4
es_mx: iCanal 4

# #30211
source: Shader as *.glsl
es_mx: Shader como *.glsl

# #30212
source: iChannel 1 as *.png
es_mx: iCanal 1 como *.png

# #30213
source: iChannel 2 as *.png
es_mx: iCanal 2 como *.png

# #30214
source: iChannel 3 as *.png
es_mx: iCanal 3 como *.png

# #30215
source: iChannel 4 as *.png
es_mx: iCanal 4 como *.png
