Repository: nguyenhunga5/opi5-kodi-addons
Catalog: screensaver.asterwave/resources/language/resource.language.*/strings.po
Languages: da_dk, zh_cn

# Addon Summary
source: AsterWave screensaver
da_dk: AsterWave pauseskærm
zh_cn: AsterWave 屏幕保护程序

# Addon Description
source: A field of liquid that deforms realistically to changes in height using actual physics equations.[CR][CR]Asteron: This code is adapted from a project I did for a graphics course in 2000. In beta testing this has garnered a lot of praise and I hope for it to replace cpBlobs as the most popular screensaver.
da_dk: Et felt af væske, der realistisk deformeres til ændringer i højden ved hjælp af aktuelle fysiske ligninger.[CR][CR]Asteron: Denne kode er tilpasset fra et projekt, jeg lavede til et grafikforløb i 2000. I betatestning har dette vundet en masse ros og jeg håber på, at det erstatter cpBlobs som den mest populære pauseskærm.
zh_cn: 这是一个液体场，使用实际的物理方程，它会随着高度的变化而发生真实的变形。[CR][CR]Asteron：这段代码改编自我2000年为一门图形课程做的一个项目。在beta测试中，这已经获得了很多赞扬，我希望它能取代cpblob成为最流行的屏幕保护程序。

# #30000
source: General
da_dk: Generel
zh_cn: 常规

# #30001
source: Quality
da_dk: Kvalitet
zh_cn: 质量

# #30002
source: Determines the resolution of the water field, higher is better/slower... tune it with physics.
da_dk: Bestemmer opløsning af vandfeltet, højere er bedre/langsommere... afstem det med fysik.
zh_cn: 确定液体场的分辨率，越高越好/越慢...用物理学来调整它。

# #30003
source: Shininess
da_dk: Glans
zh_cn: 光滑度

# #30004
source: Shininess of the fluid.
da_dk: Væskens glans.
zh_cn: 液体的光泽。

# #30005
source: Elasticity
da_dk: Elasticitet
zh_cn: 弹性

# #30006
source: Determines the springiness of the water.
da_dk: Bestemmer vandets fjedring.
zh_cn: 决定水的弹性。

# #30007
source: Viscosity
da_dk: Viskositet
zh_cn: 粘度

# #30008
source: Determines the how quickly the water quiets down.
da_dk: Bestemmer hvor hurtigt vandet bliver stille.
zh_cn: 确定水静下来的速度。

# #30009
source: X position max
da_dk: Maksimal X-position
zh_cn: X位置最大值

# #30010
source: For field rectangle and height.
da_dk: Til feltrektangel og højde.
zh_cn: 用于区域矩形和高度。

# #30011
source: X position min
da_dk: Minimum X-position
zh_cn: X位置最小值

# #30012
source: For field rectangle and height.
da_dk: Til feltrektangel og højde.
zh_cn: 用于区域矩形和高度。

# #30013
source: Y position max
da_dk: Maksimal Y-position
zh_cn: Y位置最大值

# #30014
source: For field rectangle and height.
da_dk: Til feltrektangel og højde.
zh_cn: 用于区域矩形和高度。

# #30015
source: Y position min
da_dk: Minimum Y-position
zh_cn: Y位置最小值

# #30016
source: For field rectangle and height.
da_dk: Til feltrektangel og højde.
zh_cn: 用于区域矩形和高度。

# #30017
source: Height
da_dk: Højde
zh_cn: 高

# #30018
source: For field rectangle and height.
da_dk: Til feltrektangel og højde.
zh_cn: 用于区域矩形和高度。

# #30019
source: Wireframe
da_dk: Trådgitter
zh_cn: 线框

# #30020
source: Wireframe mode.
da_dk: Tilstand for trådgitter.
zh_cn: 线框模式。

# #30021
source: Texture mode
da_dk: Tilstand for struktur
zh_cn: 纹理模式

# #30022
source: True uses a texture as a reflection map, False uses awesome colors.
da_dk: True bruger en struktur som et refleksionskort, False bruger fantastiske farver.
zh_cn: 为真使用纹理作为反射贴图，为假使用令人惊叹的颜色。

# #30023
source: Texture folder
da_dk: Mappe til struktur
zh_cn: 贴图文件夹

# #30024
source: Textures are chosen randomly from the following folder.
da_dk: Strukturer vælges tilfældigt fra følgende mappe.
zh_cn: 贴图是从以下文件夹中随机选择的。

# #30025
source: Next texture
da_dk: Næste struktur
zh_cn: 下一纹理

# #30026
source: Time in seconds between texture transitions (slideshow).
da_dk: Tid i sekunder mellem strukturovergange (diasshow).
zh_cn: 纹理变换（幻灯片放映）之间的时间（秒）。

# #30027
source: %i seconds
da_dk: %i sekunder
zh_cn: %i 秒
