Repository: nguyenhunga5/opi5-kodi-addons
Catalog: screensaver.rsxs.matrixview/resources/language/resource.language.*/strings.po
Languages: he_il, ko_kr

# Addon Summary
source: The Matrix Screensaver
he_il: שומר מסך המטריקס
ko_kr: Matrix 스크린 세이버

# Addon Description
source: This is a 3D matrix screensaver based on the digital rain scenes from The Matrix Reloaded. It features the green scrolling text (or digital rain) that wraps around 3D representations of different characters from the series.
he_il: זה שומר מסך מטריקס תלת־ממדי שמבוסס על סצנות הגשם הדיגיטלי במטריקס רילודד (Reloaded). מופיע בו הטקסט הירוק הנופל (או הגשם הדיגיטלי) שעוטף ייצוגים תלת־ממדיים של דמויות שונות מהסדרה.
ko_kr: 이것은 The Matrix Reloaded의 디지털 비 장면을 기반으로 한 3D 매트릭스 화면 보호기입니다. 그것은 시리즈의 다른 캐릭터의 3D 표현을 감싸는 녹색 스크롤 텍스트(또는 디지털 비)를 특징으로 합니다.

# Addon Disclaimer
source: This is an implementation based on "rss-glx" screensaver
he_il: יישום שמבוסס על שומר המסך „rss-glx”
ko_kr: 이것은 "rss-glx" 화면 보호기 기반입니다

# #30000
source: General
he_il: כללי
ko_kr: 일반

# #30001
source: Color of the falling text
he_il: צבע הטקסט הנופל
ko_kr: 떨어지는 글자의 색상

# #30002
source: Set color of the falling text. Can be `green', `red' or `blue'.
he_il: הגדרת צבע הטקסט הנופל. יכול להיות `green',‏ `red' או `blue' (ירוק, אדום או כחול בהתאמה).
ko_kr: 떨어지는 글자의 색상을 설정합니다. '녹색', '빨간색' 또는 '파란색'일 수 있습니다.

# #30003
source: Red
he_il: אדום
ko_kr: 빨간색

# #30004
source: Green
he_il: ירוק
ko_kr: 녹색

# #30005
source: Blue
he_il: כחול
ko_kr: 파란색

# #30006
source: Intensity of the digital rain
he_il: עצמת הגשם הדיגיטלי
ko_kr: 디지털 비의 강도

# #30007
source: Set the intensity of the digital rain. The default is 1, and is clamped to the range [1,50]. The intensity effects the number of white nodes, the number of random character changes and the general speed of the rain.
ko_kr: 디지털 비의 강도를 설정합니다. 기본값은 1이며 [1,50] 범위로 고정됩니다. 강도는 흰색 노드의 수, 임의의 문자 변경 수 및 비의 일반적인 속도에 영향을 줍니다.

# #30008
source: Classic (no images)
ko_kr: 고전 (이미지 없음)

# #30009
source: Enable static mode, which disables the display of 3D images. This mimics the style of the scrolling text from the original film.
ko_kr: 3D 이미지 표시를 사용하지 않는 정적 모드를 사용합니다. 이것은 원본 필름의 스크롤 텍스트 스타일을 모방합니다.
